{
  "talks": {
    "en": {
      "yury": {
        "title": "Chaos Engineering: Validating Hypothesis on Production",
        "description": "\nThe talk begins with an introduction to human factors, ergonomy and the design of safety systems. It continues with the definition of Chaos Engineering, its principles and phases, an explanation of the methodology for running experiments in production and an analysis of the impact in different areas.",
        "info": "Software Engineer with 9+ years of experience designing, implementing and managing the development of software applications using agile methodologies such as scrum and kanban.",
        "speaker": "Yury Niño Roa",
        "photo": "yury-nino",
        "social": {
          "web": "https://medium.com/@yury.nino.roa",
          "twitter": "https://twitter.com/yurynino",
          "linkedin": "https://www.linkedin.com/in/yurynino/"
        }
      },
      "fabio": {
        "title": "Immersive web experiences with React 360",
        "description": "\nIn early 2017, Facebook and Oculus released a library called React VR which was designed for the creation of 3D and VR experiences in the web browser. But in 2018, was renamed as React 360, which better reflects its use case: the creation of immersive 360 experiences. In this talk, we are going to explore the new concepts behind this new approach and how can we create experiences that can be consumed across PC, Mobile, and VR devices.",
        "info": "UI engineer at Jobsity and teacher at Skillshare. In love with VR and Generative Art.",
        "speaker": "Fabio Cortés",
        "photo": "fabio-cortes",
        "social": {
          "web": "https://www.fjcr.pro/",
          "twitter": "https://twitter.com/fabiojcortes",
          "linkedin": "https://www.linkedin.com/in/fabiojcortes/"
        }
      },
      "museche": {
        "title": "Take your high performance app to the web with WebAssembly",
        "description": "\nWebAssembly is a new type of code that can be executed in modern web browsers through a compact binary format that runs at near-native speed without any plugins. This have a great impact for the web, because it gives a new way to run code from other languages into the web at near native performance, providing client apps with a technology to run high performance applications in such way that was not possible before.\n\nLearn the basics of this game-changer web technology, how to start to create high performance apps from scratch or migrate existing ones to WebAssembly.",
        "info": "Miguel is a professor and web developer. Volunteering with Mozilla since 2010 and now he's a Mozilla TechSpeaker where evangelizes about open web technologies to make a better web",
        "speaker": "Miguel Ángel Useche",
        "photo": "miguel-useche",
        "social": {
          "web": "https://skatox.com/",
          "twitter": "https://twitter.com/skatox",
          "linkedin": "https://www.linkedin.com/in/skatox/"
        }
      },
      "mbolivar": {
        "title": "It takes some engineering to serve 41679 users 🚀",
        "description": "\nStarting a new job may involve reaching a new project or an existing code base 😱 and particularly in the second case is where we fail and it scares us the most, we don't want to ruin what's already built but we want to contribute as much as we can to the project , and that is why the history of the project is important 💡 We will talk about a history of how Python, React and a series of technical decisions helped to scale the service of a company, both good and bad decisions, and above all how to learn from this to not die trying to scale the project ☠️",
        "info": "Informatics Engineer 🤓 Full Stack Developer at @apploi 🚀 Maintainer of the Spanish documentation of @reactjs ⚛︎ Collaborator in @gatsbyjs and other open source projects 🧙‍♂️",
        "speaker": "Miguel Bolivar",
        "social": {
          "twitter": "https://twitter.com/Darking360",
          "linkedin": "https://www.linkedin.com/in/darking360/"
        }
      },
      "zulema": {
        "title": "Vehicle tracking system in realtime using Ionic and Google Maps",
        "description": "\nThe goal of this talk is to explain how to use Ionic Framework, Firebase and Google Maps for vehicle tracking system and I going to talk about the advantages of this system for the companies.",
        "info": "Industrial and Systems Engineer, I worked in companies like Comteco LTDA and Pil Andina S.A in Bolivia. Currently, I'm working as Freelancer in web and mobile development.",
        "speaker": "Zulema Vicente",
        "social": {
          "twitter": "https://twitter.com/vpzulema",
          "linkedin": "https://www.linkedin.com/in/zulema-vicente-46b682135/"
        }
      },
      "nathaly": {
        "title": "Microservices, nightmare or blessing?",
        "description": "\nMicroservices architecture is used when your application is not allocated in a single place o written in a single language. Thanks to them you can divide your application into different modules that have defined responsibilities and based on them you can choose the technology that best solves your problems.\n\nLet me tell you about my experience using microservices and give you a couple of tips that allow you to take the path of light, that way you can save yourself a few headaches in the future.",
        "info": "I am a full stack software engineer with four years of experience. I specialize in Ruby and have professional experience working with Ruby and JavaScript.\nI love travel and support communities.",
        "speaker": "Nathaly Villamor",
        "social": {
          "twitter": "https://twitter.com/nathalyvillamor",
          "linkedin": "https://www.linkedin.com/in/nathalyvillamor/"
        }
      }
    },
    "es": {
      "milena": {
        "title": "Domain Driven design applied to Frontend applications",
        "description": "\nFrontend used to be a monolith focused on the business line features. When it grows, the problems of scalability, performance, and coupling begin. The practical approach of DDD helps us to separated responsibilities according to business domains and have a ubiquitous language between business and engineering teams.",
        "info": "Milena Suarez is Senior Frontend Engineer at Addi. She really likes work in startups and sharing knowledge in tech events. She is a co-organizer of BogotaJS, Angular Colombia and JSConf Colombia, when not coding, she enjoys traveling, reading and drinking wine.",
        "speaker": "Milena Suarez",
        "social": {
          "twitter": "https://twitter.com/milena_suarezl",
          "linkedin": "https://www.linkedin.com/in/milenasuarezl/"
        }
      },
      "fabio": {
        "title": "Experiencias inmersivas en la web con React 360",
        "description": "\nA comienzos del 2017, Oculus y Facebook publicaron una libreraría llamada React VR, diseñada para la creación de experiencias 3D y de realidad virtual en la web. Sin embargo, en el 2018, decidieron cambiar el enfoque de este proyecto open source y renombrarlo como React 360.  En esta nueva versión, se agregaron novedosos elementos de UI en 2D y se introdujeron nuevos conceptos como Runtime, Executors y Surfaces. En esta charla, exploraremos estos nuevos conceptos y cómo, gracias a este nuevo enfoque, podemos crear experiencias inmersivas en la web con React 360.",
        "info": "Ingeniero de UI en Jobsity y profesor en Skillshare. Apasionado por el arte generativo y las experiencias de realidad virtual.",
        "speaker": "Fabio Cortés",
        "photo": "fabio-cortes",
        "social": {
          "web": "https://www.fjcr.pro/",
          "twitter": "https://twitter.com/fabiojcortes",
          "linkedin": "https://www.linkedin.com/in/fabiojcortes/"
        }
      },
      "cristian": {
        "title": "Programación Funcional para no-batos",
        "description": "\nLa programación funcional la vivimos día a día, ahora que tal si la combinamos con estrategias para aprovecharla de una manera mas inteligente. En esta charla veremos el uso de tipos, funciones y estructuras que nos permitirán elaborar un caso de uso completo, todo usando Kotlin!",
        "info": "Cristian is a Software Developer, currently focused on the Android Platform creating apps and SDKs. He is very active in the Android Community and serves as a Co-Organizer of the Medellin Android Meetup, a group of professional Android developers in Colombia.",
        "speaker": "Cristian Gomez",
        "social": {
          "twitter": "http://twitter.com/iyubinest",
          "linkedin": "https://www.linkedin.com/in/iyubinest/"
        }
      },
      "yury": {
        "title": "Ingeniería del Caos: Probando Hipótesis en Producción",
        "description": "\nLa charla empieza con una introducción a los factores humanos, la ergonomía y el diseño de sistemas seguros. Continúa con la definición de Ingeniería del Caos, sus principios y fases, una explicación de la metodología para correr experimentos en producción y un análisis del impacto en diferentes áreas.",
        "info": "Ingeniera DevOps con 9+ años de experiencia diseñando, implementando y administrando el desarrollo de aplicaciones de software usando metodologías ágiles.",
        "speaker": "Yury Niño Roa",
        "photo": "yury-nino",
        "social": {
          "web": "https://medium.com/@yury.nino.roa",
          "twitter": "https://twitter.com/yurynino",
          "linkedin": "https://www.linkedin.com/in/yurynino/"
        }
      },
      "mbolivar": {
        "title": "Se requiere algo de ingeniería para servir a 41679 usuarios 🚀",
        "description": "\nEmpezar en un nuevo trabajo puede implicar llegar a un proyecto nuevo o a una base de código ya existente 😱 y particularmente en el segundo caso es donde fallamos y nos asusta más, no queremos arruinar lo que ya existe pero queremos aportar lo más que podamos al proyecto, y por eso es importante la historia del proyecto 💡 Hablaremos de una historia de como Python, React y una serie de decisiones técnicas ayudaron a escalar el servicio de una empresa, decisiones tanto buenas como malas, y sobre todo como aprender de esto para no morir intentando escalar el proyecto ☠️",
        "info": "Ingeniero en Informática 🤓 Desarrollador Full Stack en @apploi 🚀 Mantenedor de la documentación en español de @reactjs ⚛︎ Colaborador en @gatsbyjs y otros proyectos de código abierto 🧙‍♂️ ",
        "speaker": "Miguel Bolivar",
        "social": {
          "twitter": "https://twitter.com/Darking360",
          "linkedin": "https://www.linkedin.com/in/darking360/"
        }
      },
      "nathaly": {
        "title": "Microservicios, ¿pesadilla o bendición?",
        "description": "\nLa arquitectura de microservicios es aquella en la cual tu aplicación no está alojada en un solo lugar o escrita en una misma tecnología. Gracias a ellos puedes dividir tu aplicación en diferentes módulos que tengan responsabilidades definidas y en base a ellos puedes escoger la tecnología que mejor solucione sus problemas.\n\nDéjame contarte sobre mi experiencia usando microservicios y darte un par de tips que te permitan tomar el camino de la luz, de esa forma podrás ahorrarte unos cuantos dolores de cabeza en el futuro.",
        "info": "Soy Ingeniera de Sistemas egresada de la Universidad Distrital. Tengo de 4 años de experiencia desarrollando software en tecnologías como Ruby y JavaScript.\nMe encanta viajar y apoyar comunidades.",
        "speaker": "Nathaly Villamor",
        "social": {
          "twitter": "https://twitter.com/nathalyvillamor",
          "linkedin": "https://www.linkedin.com/in/nathalyvillamor/"
        }
      },
      "jesus": {
        "title": "Movie Genre Classification Using Deep Multimodal Neural Networks",
        "description": "\nEn la presente charla se explicará cómo hacer uso del deep learning para automatizar la clasificación de las películas gracias a la interpretación del texto y las imágenes. En detalle, se explicarán el funcionamiento y el uso de las redes neuronales convolucionales y el transfer learning para el procesamiento de las imágenes en los posters. Y, por otro lado, se explicarán las redes neuronales recurrentes en combinación con métodos no supervisados (Word2Vec) para el pre-procesamiento y entrenamiento de los algoritmos de clasificación de la sinopsis.\n\nFinalmente, se hablará de cómo agregar la información de ambos tipos de datos - imágenes y texto- en una red neuronal multi modal para encontrar los géneros a los que pertenece una película.",
        "info": "Su pasión es analizar y resolver problemas de la vida real utilizando algoritmos de machine learning. Jesús es Físico e Ingeniero Industrial de la Universidad de los Andes, Colombia. Sus proyectos de investigación han estado enfocados en la aplicación del Deep Learning a problemas financieros, procesamiento de imágenes, ciberseguridad y física de altas energías.",
        "speaker": "Jesús Solano",
        "social": {
          "linkedin": "https://www.linkedin.com/in/jesus-solano-go"
        }
      },
      "zulema": {
        "title": "Rastreo de vehículos distribuidores en tiempo real usando Ionic y Google Maps",
        "description": "\nLa logística de una empresa es un área bastante amplia entre ellas una de las más importantes es la distribución de sus productos. En este caso la tendencia de poder controlar la distribución de insumos o productos es uno de los ejemplos más relevantes, ya que el costo de distribución influye el 15% del costo unitario de un producto. Es ahí donde nace la necesidad de mejorar este proceso garantizando al cliente un producto de calidad con un precio justo. El objetivo de la charla es dar a conocer cómo Ionic y Google Maps nos ayuda a realizar un seguimiento y rastreo de vehículos distribuidores para controlar y tener el seguimiento de las rutas de los mismos y las ventajas que trae implementar este software en el proceso.",
        "info": "Ingeniera Industrial y de Sistemas he trabajado en las empresas como Comteco LTDA y Pil Andina S.A. Actualmente me desenvuelvo como freelancer en desarrollo web y móvil.",
        "speaker": "Zulema Vicente",
        "social": {
          "twitter": "https://twitter.com/vpzulema",
          "linkedin": "https://www.linkedin.com/in/zulema-vicente-46b682135/"
        }
      },
      "museche": {
        "title": "Crea aplicaciones de alto rendimiento con WebAssembly",
        "description": "\nWebAssembly es un nuevo tipo de código que puede ser ejecutado por los navegadores actuales, a través de un binario que se ejecuta a velocidad casi nativas sin la necesidad de usar plugins. Esto trae un nuevo impacto a la web porque da una nueva forma de correr código de otros lenguajes a la web a velocidades casi nativas. Permitiendo contar con aplicaciones de alto rendimiento en el lado del navegador con tecnologías que no eran posibles anteriormente.\n\nAprende lo básico de esta tecnología, descubre cómo crear aplicaciones de alto rendimiento desde 0 o cómo migrar existentes a WebAssembly.",
        "info": "Profesor universitario, desarrollador web. Voluntario de Mozilla desde el 2010 y ahora es Mozilla Tech Speaker para evangelizar sobre las últimas  tecnologías web abiertas y construir una mejor web.",
        "speaker": "Miguel Ángel Useche",
        "photo": "miguel-useche",
        "social": {
          "web": "https://skatox.com/",
          "twitter": "https://twitter.com/skatox",
          "linkedin": "https://www.linkedin.com/in/skatox/"
        }
      },
      "adrian": {
        "title": "Computational Complexity and JavaScript",
        "description": "\nA talk to analyze the implications of heavy computations in JavaScript, we will visit the best practices and alternatives to do complex operations.",
        "info": "Developer in love with Node.js, thirsty for new technologies, official Node.js Collaborator  - organizer @MedellinJS, @JSConfCO and @NodeConfCO",
        "speaker": "Adrián Estrada",
        "social": {
          "twitter": "https://twitter.com/edsadr"
        }
      }
    }
  }
}
